Revit 2026 API

# IPerformanceAdviserRuleGetDescription Method

---

Retrieves the description of the rule.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
string GetDescription()
```
```vb
Function GetDescription As String
```
```cpp
String^ GetDescription()
```
```fsharp
abstract GetDescription : unit -> string
```

#### Return Value

String The description of the rule.

Method should return a brief (one-two sentences) description of the rule. String should be localized.

#### Reference

IPerformanceAdviserRule Interface

Autodesk.Revit.DB Namespace